In [1]:
####Handling Missing Data
import pandas as pd
from numpy import nan as NA
Ser=pd.Series([1,2,NA,'Aman','Agarwal',NA,NA,'xyz'])
Ser

0          1
1          2
2        NaN
3       Aman
4    Agarwal
5        NaN
6        NaN
7        xyz
dtype: object

In [2]:
Ser.isnull() #return the boolean Array

0    False
1    False
2     True
3    False
4    False
5     True
6     True
7    False
dtype: bool

In [3]:
Ser.notnull()

0     True
1     True
2    False
3     True
4     True
5    False
6    False
7     True
dtype: bool

In [4]:
Ser.dropna() #dropping the NA values

0          1
1          2
3       Aman
4    Agarwal
7        xyz
dtype: object

In [5]:
Ser.fillna(0) #filling the NA values with the 0

0          1
1          2
2          0
3       Aman
4    Agarwal
5          0
6          0
7        xyz
dtype: object

In [6]:
##########Filltering out missing data
Ser[Ser.notnull()] #returns the Series of those values in which NA is not there

0          1
1          2
3       Aman
4    Agarwal
7        xyz
dtype: object

In [7]:
##########Applying the operations on the datframes
df=pd.DataFrame({'x':[1,2,3,NA],'y':[4,5,NA,NA],'z':[10,NA,NA,NA],'L':[NA,NA,NA,NA]})

In [8]:
print(df)

     x    y     z   L
0  1.0  4.0  10.0 NaN
1  2.0  5.0   NaN NaN
2  3.0  NaN   NaN NaN
3  NaN  NaN   NaN NaN

In [9]:
df.dropna() #it will remove those rows those have the NA in the row

Empty DataFrame
Columns: [x, y, z, L]
Index: []

In [10]:
#by applying how='all' will result if a row conatins all the NaN value
df.dropna(how='all') #the result can be seen below

     x    y     z   L
0  1.0  4.0  10.0 NaN
1  2.0  5.0   NaN NaN
2  3.0  NaN   NaN NaN

In [11]:
df.dropna(axis=1,how='all') #along the columns it will check 
#result can be seen below

     x    y     z
0  1.0  4.0  10.0
1  2.0  5.0   NaN
2  3.0  NaN   NaN
3  NaN  NaN   NaN

In [12]:
##Thresh tells about the minimum values of the na values to drop
df.dropna(thresh=1)

     x    y     z   L
0  1.0  4.0  10.0 NaN
1  2.0  5.0   NaN NaN
2  3.0  NaN   NaN NaN

In [13]:
########Filling the missing data
###Calling fillna function to fill the holes those are created vy the na values
df.fillna(0) #it will put 0 at the palce odf the na values

     x    y     z    L
0  1.0  4.0  10.0  0.0
1  2.0  5.0   0.0  0.0
2  3.0  0.0   0.0  0.0
3  0.0  0.0   0.0  0.0

In [14]:
df.fillna({'x':0,'y':1})  #at the place of the rows x there will be zero at the place of the na and in the  y columns it iwll place the 1 at the plavce of the 1

     x    y     z   L
0  1.0  4.0  10.0 NaN
1  2.0  5.0   NaN NaN
2  3.0  1.0   NaN NaN
3  0.0  1.0   NaN NaN

In [15]:
#fillna returns the new object by the inplace operator you can modify the existing once
df.fillna({'x':0,'y':1},inplace=True)

In [16]:
print(df) #it has changed the modified the existing dataframe

     x    y     z   L
0  1.0  4.0  10.0 NaN
1  2.0  5.0   NaN NaN
2  3.0  1.0   NaN NaN
3  0.0  1.0   NaN NaN

In [17]:
df.fillna(method='ffill',limit=2) #forward filling by apppying the limit we can put the limit show that only the two na values rows will be modified

     x    y     z   L
0  1.0  4.0  10.0 NaN
1  2.0  5.0  10.0 NaN
2  3.0  1.0  10.0 NaN
3  0.0  1.0   NaN NaN

In [18]:
df.fillna(df.mean())  #it will fill by the mean value

     x    y     z   L
0  1.0  4.0  10.0 NaN
1  2.0  5.0  10.0 NaN
2  3.0  1.0  10.0 NaN
3  0.0  1.0  10.0 NaN

In [19]:
data=pd.DataFrame({'k1':['one','two']*3 + ['two'],'k2':[1,2,3,4,5,1,6]})

In [20]:
print(data)

    k1  k2
0  one   1
1  two   2
2  one   3
3  two   4
4  one   5
5  two   1
6  two   6

In [21]:
data.duplicated(
) #it will return the boolean series where it will tell whether each row is duplicate or not return true if row is dupliacte otherwise return false

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [22]:
data.drop_duplicates()  #drop duplicates will drop the the dupliactes rows

    k1  k2
0  one   1
1  two   2
2  one   3
3  two   4
4  one   5
5  two   1
6  two   6

In [23]:
data['v1']=range(7)

In [24]:
print(data
     )

    k1  k2  v1
0  one   1   0
1  two   2   1
2  one   3   2
3  two   4   3
4  one   5   4
5  two   1   5
6  two   6   6

In [25]:
data.drop_duplicates(['k1']) #it willl drop the duplicates from the k1 column

    k1  k2  v1
0  one   1   0
1  two   2   1

In [26]:
##basically by the drop_duplicates and the duplicated will observe from the starting by keepingg the keep='last' we can observe from the last 
data.drop_duplicates(['k1'],keep='last')  #now it is observing form the last

    k1  k2  v1
4  one   5   4
6  two   6   6

In [27]:
########Transforming Data Using a Function or Mapping#########
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef', 'Bacon','pastrami', 'honey ham', 'nova lox'],'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [28]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [29]:
#This is the dictionary which we are using for the mapping
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [30]:
print(meat_to_animal)

{'bacon': 'pig', 'pulled pork': 'pig', 'pastrami': 'cow', 'corned beef': 'cow', 'honey ham': 'pig', 'nova lox': 'salmon'}

In [31]:
lowerbased=data['food'].str.lower()

In [32]:
print(lowerbased)

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [33]:
data['animal'] = lowerbased.map(meat_to_animal)  #it is mapping at the meat to animal using lowerbased and passing the values according to it.
#to add the new column =

In [34]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [35]:
data['food'].map(lambda x:meat_to_animal[x.lower()])  #we are using just the anonymous function whcih is actually returning the value which we are accessing using teh key

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [36]:
####Replacingg values
data=pd.Series([1,2,3,4,5,6,7
               ])

In [37]:
print(data)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [38]:
data.replace(1,99)

0    99
1     2
2     3
3     4
4     5
5     6
6     7
dtype: int64

In [39]:
import numpy as np
data.replace(7,np.nan)

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    NaN
dtype: float64

In [40]:
data.replace([3,4],np.nan)

0    1.0
1    2.0
2    NaN
3    NaN
4    5.0
5    6.0
6    7.0
dtype: float64

In [41]:
data.replace([2,4],[np.nan,0]) #replacing 2 by nan and 4 by 0

0    1.0
1    NaN
2    3.0
3    0.0
4    5.0
5    6.0
6    7.0
dtype: float64

In [42]:
###Renaming Axis Indexes######
data=pd.DataFrame(np.arange(12).reshape((3,4)),index=['a','b','c'],columns=['A','B','C','D'])

In [43]:
data

   A  B   C   D
a  0  1   2   3
b  4  5   6   7
c  8  9  10  11

In [44]:
transform = lambda x:x[:4].upper()

In [45]:
xyz=data.index.map(transform)

In [46]:
print(xyz)

Index(['A', 'B', 'C'], dtype='object')

In [47]:
data.index=data.index.map(transform)

In [48]:
print(dat)

NameError: name 'dat' is not defined

In [49]:
print(data)

   A  B   C   D
A  0  1   2   3
B  4  5   6   7
C  8  9  10  11

In [50]:
data.rename(index= str.lower,columns=str.lower) ###renaming of the axes

   a  b   c   d
a  0  1   2   3
b  4  5   6   7
c  8  9  10  11

In [51]:
print(daat)

NameError: name 'daat' is not defined

In [52]:
print(data)

   A  B   C   D
A  0  1   2   3
B  4  5   6   7
C  8  9  10  11

In [53]:
data.rename(index= str.lower,columns=str.lower,inplace=True) ###renaming of the axes

In [54]:
print(data)

   a  b   c   d
a  0  1   2   3
b  4  5   6   7
c  8  9  10  11

In [57]:
#############Discretization and Binning###############
ages=[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins=[18, 25, 35, 60, 100]
z=pd.cut(ages,bins)
print(z)

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [58]:
z.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [59]:
z.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [61]:
pd.value_counts(z)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [63]:
f=pd.cut(ages,bins,right=False)

In [64]:
pd.value_counts(f)

[25, 35)     4
[18, 25)     4
[35, 60)     3
[60, 100)    1
dtype: int64

In [65]:
data=np.random.randn(20)

In [66]:
print(data)

[ 0.87954929 -0.70177982  0.58744923 -0.38848595  0.03190018  0.45202169
  0.98521436 -0.75361246 -0.49296635 -1.09008488 -0.10352163 -0.31501977
  0.58260025  1.2889542  -1.74529065  0.00875155  1.07073631  0.754427
  0.96019258 -0.64107508]

In [67]:
pd.cut(data,4,precision=2) #by passing precision=2 means we are just precising the values upto two points after the decimal

[(0.53, 1.29], (-0.99, -0.23], (0.53, 1.29], (-0.99, -0.23], (-0.23, 0.53], ..., (-0.23, 0.53], (0.53, 1.29], (0.53, 1.29], (0.53, 1.29], (-0.99, -0.23]]
Length: 20
Categories (4, interval[float64]): [(-1.75, -0.99] < (-0.99, -0.23] < (-0.23, 0.53] < (0.53, 1.29]]

In [70]:
data=np.random.randn(1000)
cats=pd.qcut(data,4) #cut into quartiles
print(cats)

[(0.697, 3.491], (-0.605, 0.083], (0.083, 0.697], (0.697, 3.491], (-2.877, -0.605], ..., (0.083, 0.697], (0.697, 3.491], (0.697, 3.491], (-0.605, 0.083], (-2.877, -0.605]]
Length: 1000
Categories (4, interval[float64]): [(-2.877, -0.605] < (-0.605, 0.083] < (0.083, 0.697] < (0.697, 3.491]]

In [73]:
##########Detecting and Filtering Outliers##########
data1=pd.DataFrame(np.random.randn(1000,4))

In [74]:
print(data1)

            0         1         2         3
0   -0.052396 -1.300455 -0.281394  1.198102
1    0.103120  0.073767  0.037666  0.756264
2   -1.129055 -0.490605  1.625518 -0.255928
3    0.159420  1.276767  0.586251  1.301496
4    2.112075  0.896063 -0.882441  1.416439
5    0.636762  0.115886  1.085780 -0.286188
6    0.480926 -0.955534  0.936280  0.794597
7   -0.369852 -0.914702 -2.139072  2.242882
8   -0.607471 -0.346077 -0.826413 -1.219512
9    0.635662 -0.092583 -1.150904  1.018045
10  -0.079859  0.301127  0.230245  1.369969
11  -0.712684 -0.713303 -0.314459  0.312083
12  -0.827888  0.561196 -0.369034  1.124907
13   0.452669 -0.911126  0.806213  0.910464
14   0.507644  1.582689 -1.224377 -1.462069
15  -0.012516  0.422767 -0.457585  0.596824
16  -1.618120 -1.387894  1.875448  0.238496
17  -1.292908  0.791093  0.609277  0.411489
18  -0.955250 -0.446828 -0.174085  0.946708
19   1.483944 -1.090750 -0.321441 -1.453503
20  -1.480895 -1.666625 -0.498309  0.768795
21   0.294756  0.429999 -0.553258 -1.164300
22  -0.586288 -2.554693 -1.626994  1.409056
23   0.383014 -0.070095  1.048328  0.136127
24  -1.040921 -1.073685  0.883875  0.081458
25  -1.200496 -0.764810  0.487594  0.766223
26  -1.078727  0.073059  0.847842  0.686861
27  -0.303776  0.429453  1.556956  1.467671
28   1.081013  0.243626  0.785413  1.643606
29  -0.937516 -0.920180  0.843105  1.576715
..        ...       ...       ...       ...
970  0.667765 -0.829462  1.749073 -0.324953
971 -0.786768 -1.855446 -1.075908  0.858669
972  0.320170  0.440898  1.281680 -1.363615
973  0.750461 -0.095411 -0.924180  0.042451
974 -0.456345 -0.076766 -0.608492  0.380505
975  1.358080  0.721784  0.557048  0.098265
976 -0.032877  0.208214 -0.539416 -2.044423
977  1.940196 -0.701329  0.994263  0.366935
978  2.160942  0.093628 -0.595044  1.290962
979  0.947053 -0.620597 -0.710337  0.482043
980 -0.990992 -2.050356 -0.259186 -1.036922
981 -1.102900  0.584130  0.001524 -0.209242
982 -0.152453  1.064162  0.087518 -0.651674
983  0.122844 -0.831746 -0.182871 -0.079369
984 -0.785957 -2.162632  1.083925 -1.254922
985 -1.021233 -0.157029  1.533777 -0.889014
986 -1.326168 -0.834975 -1.497616  0.819412
987 -2.460625  1.027496  0.116993 -1.961290
988 -0.726460 -0.657392  0.551206  1.130307
989  0.428669  1.523600 -0.375682 -0.300917
990 -0.708273  1.465191  0.483124 -0.834673
991  0.602303  1.334037 -0.999790 -0.003678
992  0.739669  2.064510  1.404640  2.297252
993 -0.452530 -0.286661  1.040793 -1.787853
994 -0.453626 -1.746225  1.305561 -0.801545
995  0.087677 -1.162348 -1.159461 -1.144922
996  0.994591 -2.207282 -0.507972 -0.419638
997 -1.977380 -0.262960 -1.806315 -0.186450
998  0.264229 -1.803300  1.443099 -0.555746
999  0.857658  1.004924  2.392096  0.428499

[1000 rows x 4 columns]

In [75]:
data1.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.017309    -0.013862    -0.019339    -0.023433
std       1.027750     0.981865     1.018304     0.996065
min      -3.461560    -2.712567    -3.822863    -3.205378
25%      -0.714748    -0.662566    -0.715509    -0.723053
50%       0.015610     0.017136    -0.018003    -0.023346
75%       0.686125     0.659659     0.679313     0.642003
max       2.606125     2.632676     2.847022     3.595209

In [76]:
col=data1[2]

In [77]:
print(col)

0     -0.281394
1      0.037666
2      1.625518
3      0.586251
4     -0.882441
5      1.085780
6      0.936280
7     -2.139072
8     -0.826413
9     -1.150904
10     0.230245
11    -0.314459
12    -0.369034
13     0.806213
14    -1.224377
15    -0.457585
16     1.875448
17     0.609277
18    -0.174085
19    -0.321441
20    -0.498309
21    -0.553258
22    -1.626994
23     1.048328
24     0.883875
25     0.487594
26     0.847842
27     1.556956
28     0.785413
29     0.843105
         ...
970    1.749073
971   -1.075908
972    1.281680
973   -0.924180
974   -0.608492
975    0.557048
976   -0.539416
977    0.994263
978   -0.595044
979   -0.710337
980   -0.259186
981    0.001524
982    0.087518
983   -0.182871
984    1.083925
985    1.533777
986   -1.497616
987    0.116993
988    0.551206
989   -0.375682
990    0.483124
991   -0.999790
992    1.404640
993    1.040793
994    1.305561
995   -1.159461
996   -0.507972
997   -1.806315
998    1.443099
999    2.392096
Name: 2, Length: 1000, dtype: float64

In [78]:
col[np.abs(col)>3] #it will give the entry from the column in which absolte value of the column is greater than 3

329   -3.822863
Name: 2, dtype: float64

In [83]:
data1[(np.abs(data1)>3).any(1)] #if any entry is greater than 3

            0         1         2         3
156 -1.202490 -0.215052  1.015517  3.595209
264 -1.096471 -0.465938  0.929320 -3.205378
298 -3.461560 -2.471711  2.670072 -1.093244
329  0.087715  0.441557 -3.822863 -0.207790
901 -0.538740 -1.201532 -0.143231  3.294782

In [86]:
data1[(np.abs(data1)>3).all(1)] #empty because none all the entries are greate than 3

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

data1[(np.abs(data1)>3)]=np.sign(data1)*3

In [91]:
z=data1[(np.abs(data1)>3)]=np.sign(data1)*3

In [92]:
print(z)

       0    1    2    3
0   -3.0 -3.0 -3.0  3.0
1    3.0  3.0  3.0  3.0
2   -3.0 -3.0  3.0 -3.0
3    3.0  3.0  3.0  3.0
4    3.0  3.0 -3.0  3.0
5    3.0  3.0  3.0 -3.0
6    3.0 -3.0  3.0  3.0
7   -3.0 -3.0 -3.0  3.0
8   -3.0 -3.0 -3.0 -3.0
9    3.0 -3.0 -3.0  3.0
10  -3.0  3.0  3.0  3.0
11  -3.0 -3.0 -3.0  3.0
12  -3.0  3.0 -3.0  3.0
13   3.0 -3.0  3.0  3.0
14   3.0  3.0 -3.0 -3.0
15  -3.0  3.0 -3.0  3.0
16  -3.0 -3.0  3.0  3.0
17  -3.0  3.0  3.0  3.0
18  -3.0 -3.0 -3.0  3.0
19   3.0 -3.0 -3.0 -3.0
20  -3.0 -3.0 -3.0  3.0
21   3.0  3.0 -3.0 -3.0
22  -3.0 -3.0 -3.0  3.0
23   3.0 -3.0  3.0  3.0
24  -3.0 -3.0  3.0  3.0
25  -3.0 -3.0  3.0  3.0
26  -3.0  3.0  3.0  3.0
27  -3.0  3.0  3.0  3.0
28   3.0  3.0  3.0  3.0
29  -3.0 -3.0  3.0  3.0
..   ...  ...  ...  ...
970  3.0 -3.0  3.0 -3.0
971 -3.0 -3.0 -3.0  3.0
972  3.0  3.0  3.0 -3.0
973  3.0 -3.0 -3.0  3.0
974 -3.0 -3.0 -3.0  3.0
975  3.0  3.0  3.0  3.0
976 -3.0  3.0 -3.0 -3.0
977  3.0 -3.0  3.0  3.0
978  3.0  3.0 -3.0  3.0
979  3.0 -3.0 -3.0  3.0
980 -3.0 -3.0 -3.0 -3.0
981 -3.0  3.0  3.0 -3.0
982 -3.0  3.0  3.0 -3.0
983  3.0 -3.0 -3.0 -3.0
984 -3.0 -3.0  3.0 -3.0
985 -3.0 -3.0  3.0 -3.0
986 -3.0 -3.0 -3.0  3.0
987 -3.0  3.0  3.0 -3.0
988 -3.0 -3.0  3.0  3.0
989  3.0  3.0 -3.0 -3.0
990 -3.0  3.0  3.0 -3.0
991  3.0  3.0 -3.0 -3.0
992  3.0  3.0  3.0  3.0
993 -3.0 -3.0  3.0 -3.0
994 -3.0 -3.0  3.0 -3.0
995  3.0 -3.0 -3.0 -3.0
996  3.0 -3.0 -3.0 -3.0
997 -3.0 -3.0 -3.0 -3.0
998  3.0 -3.0  3.0 -3.0
999  3.0  3.0  3.0  3.0

[1000 rows x 4 columns]

In [94]:
np.sign(data1).head() #displaying the sign value of the starting 5 data values

     0    1    2    3
0 -1.0 -1.0 -1.0  1.0
1  1.0  1.0  1.0  1.0
2 -1.0 -1.0  1.0 -1.0
3  1.0  1.0  1.0  1.0
4  1.0  1.0 -1.0  1.0

In [95]:
##########Permutation and the random sampling####
df=pd.DataFrame(np.arange(20).reshape(5,4))

In [96]:
print(df)

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [106]:
sampler=np.random.permutation(5) #it is basically permuting the rows from there starting name

In [107]:
print(sampler)

[3 0 2 1 4]

In [108]:
df.take(sampler  #inedxing is in the same oreder in which the sampler is it is based on the iloc location
       )

    0   1   2   3
3  12  13  14  15
0   0   1   2   3
2   8   9  10  11
1   4   5   6   7
4  16  17  18  19

In [109]:
df.sample(n=3) #it will select the starting 3 permuted rows which will be in the random order

    0   1   2   3
3  12  13  14  15
0   0   1   2   3
1   4   5   6   7

In [110]:
x=pd.Series([1,223,4,567,8,9,876543,1,12,3,4,5,6,78])

In [112]:
print(x)

0          1
1        223
2          4
3        567
4          8
5          9
6     876543
7          1
8         12
9          3
10         4
11         5
12         6
13        78
dtype: int64

In [133]:
select= x.sample(n=10,replace=False) #here replacemet is not allowed because we are passing replace=False as we do in the permutation

In [134]:
print(select)

12         6
7          1
8         12
10         4
9          3
1        223
11         5
13        78
5          9
6     876543
dtype: int64

In [139]:
###############Dummy Variables##################
df=pd.DataFrame({'key':['b','b','b','a','a','c','c'],'data1':range(7)})

In [140]:
print(df)

  key  data1
0   b      0
1   b      1
2   b      2
3   a      3
4   a      4
5   c      5
6   c      6

In [143]:
pd.get_dummies(df['key']) #giving the 0s and 1s table in which 1 are telling that element is present at that index and 0 this element is not there at that index

   a  b  c
0  0  1  0
1  0  1  0
2  0  1  0
3  1  0  0
4  1  0  0
5  0  0  1
6  0  0  1

In [144]:
dummies=pd.get_dummies(df['key'],prefix='key') #it is same as pd.get_dummies(df)

In [145]:
print(dummies)

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      0      1      0
3      1      0      0
4      1      0      0
5      0      0      1
6      0      0      1

In [146]:
df_with_dummies=df[['data1']].join(dummies)  #it is perfroming the joining operation with the data1

In [147]:
print(df_with_dummies)

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      0      1      0
3      3      1      0      0
4      4      1      0      0
5      5      0      0      1
6      6      0      0      1